/*
Определение Sets
- Sets в JavaScript, известные как множества, представляют собой структуру данных, вдохновленную математическим понятием множества.
- Множество в математике это собрание объектов, названных элементами. В информатике, множества реализуют эту концепцию, позволяя хранить набор разнотипных, но уникальных элементов.

Отличия от массивов
- Главное отличие от массивов — уникальность элементов. Каждый элемент в множестве уникален, в отличие от массивов, где одно значение может повторяться.
- Множества не упорядочены. Порядок элементов не фиксируется и для работы с множеством не является важным.

Примеры использования
- Пример с городами: Москва, Лондон, Париж представлены как элементы множества городов. Каждый город уникален.
- Пример с ролями в компании: Программист, SEO-специалист, Дизайнер, Системный администратор выступают в качестве уникальных элементов множества ролей.
*/
