/*
Введение в Map:
- Создание Map с парами ключ-значение (Лондон: 10, Москва: 7, Париж: 14).

Итерация по Map:
- Основной метод итерации: использование цикла for...of для доступа к парам ключ-значение.
- Деструктуризация в цикле for...of позволяет удобно разделить ключи и значения (key, value).

Методы и особенности Map:
+ Преобразование Map в массив:
  - Использование spread синтаксиса (...) для преобразования.
+ Доступ к ключам и значениям:
  - Методы .keys() и .values() для получения ключей и значений соответственно.
  - Преобразование итераторов, возвращаемых .keys() и .values(), в массивы с помощью spread синтаксиса.

Способы итерации по Map:
- Использование цикла for...of для обхода клю-значения (наиболее часто используемый).
- Преобразование в массив с последующей итерацией по массиву.
- Итерирование по ключам или значениям после преобразования в массивы.
*/
