/*
Введение в библиотеку Math
- Объект Math представляет собой глобальный объект, предоставляющий свойства и методы для выполнения математических операций.

Расчёт квадратного и кубического корней
- Использование методов Math.sqrt() и Math.cbrt() для расчёта квадратного и кубического корней чисел соответственно.
- Для расчёта корней других степеней можно использовать возведение в степень с помощью оператора **.

Определение знака числа и модуль числа
- Math.sign() возвращает 1 для положительных чисел и -1 для отрицательных.
- Math.abs() преобразует число в его абсолютное значение (модуль).

Минимальное и максимальное значения
- Math.max() и Math.min() для нахождения максимального и минимального числа из набора чисел.
- Преобразование массива чисел в аргументы функции с помощью спред-оператора (...).

Генерация случайных чисел
- Math.random() для генерации псевдослучайного числа в диапазоне от 0 до 1.

Заключение
- Библиотека Math обладает множеством полезных методов для выполнения разнообразных математических операций, включая округление, которое будет рассмотрено отдельно.
*/
