/*
Основы Оператора Остатка от Деления
- Что Это: Оператор остатка от деления помогает найти остаток после деления одного числа на другое.
- Как Работает: Этот оператор не просто делит числа, но и показывает, что остается после целочисленного деления. Например, 15 делится на 2 с остатком 1, потому что 15 = (7 * 2) + 1.

Примеры Использования
1. Проверка Четности:
  - Функция IsEven проверяет, является ли число четным. Если число делится на 2 без остатка, результат true (четное), иначе false (нечетное).
  - Пример: IsEven(12) вернет true, IsEven(15) вернет false.
2. Проверка Нечетности:
  - Аналогично, функция IsOdd определяет, является ли число нечетным. Если при делении на 2 остается остаток 1, число считается нечетным.
  - Пример: IsOdd(17) вернет true, IsOdd(12) вернет false.

Заключение
- Оператор остатка от деления служит удобным инструментом не только для проверки четности или нечетности чисел, но и для других задач, где требуется определить остаток от деления. Важно знать и уметь правильно использовать этот оператор в различных видах вычислений.
*/
